app/Controllers/ProdukController.php

    public function download()
    {
            //get data from database
        $product = $this->product->findAll();
---
SELECT *
FROM `product`